
# SELECT Queries on EMP Table â€“ MySQL

This notebook focuses exclusively on **SELECT queries** executed on the `emp` table.
Each query demonstrates a specific SQL concept such as filtering, pattern matching,
date handling, aggregation, grouping, and sorting.

All queries are written in **MySQL-compatible syntax** and assume that the `emp` table
already exists and is populated.

### Annual Salary Filter
This query calculates the annual salary and retrieves employees whose annual salary exceeds 30,000.

In [ ]:
SELECT ename, sal, sal * 12 AS annual_salary
FROM emp
WHERE sal * 12 > 30000;

### Filter Using OR Condition
Fetches employees whose job role is either SALESMAN or ANALYST.

In [ ]:
SELECT *
FROM emp
WHERE job = 'SALESMAN' OR job = 'ANALYST';

### Filter Using IN Clause
Retrieves employees whose job belongs to a specified list of roles.

In [ ]:
SELECT *
FROM emp
WHERE job IN ('SALESMAN','ANALYST');

### Filter by Department Numbers
Fetches employees working in department 10 or 20.

In [ ]:
SELECT *
FROM emp
WHERE deptno IN (10,20);

### Pattern Matching Using LIKE
Retrieves employees whose names start with the letter 'M'.

In [ ]:
SELECT *
FROM emp
WHERE ename LIKE 'M%';

### Filter by Year of Hire
Fetches employees hired in the year 1981.

In [ ]:
SELECT *
FROM emp
WHERE YEAR(hiredate) = 1981;

### DISTINCT Values
Retrieves the unique job roles available in the EMP table.

In [ ]:
SELECT DISTINCT job FROM emp;

### Substring-Based Filtering
Fetches employees whose name contains 'LA' starting from the second character.

In [ ]:
SELECT *
FROM emp
WHERE SUBSTRING(ename, 2, 2) = 'LA';

### Replace Text in Output
Replaces the job title SALESMAN with MARKETING in the result set.

In [ ]:
SELECT job, REPLACE(job, 'SALESMAN', 'MARKETING') AS updated_job
FROM emp;

### Filter by Day Name
Retrieves employees who were hired on a Thursday.

In [ ]:
SELECT *
FROM emp
WHERE DAYNAME(hiredate) = 'Thursday';

### Add Months to a Date
Calculates the review date by adding 6 months to the hire date.

In [ ]:
SELECT ename, DATE_ADD(hiredate, INTERVAL 6 MONTH) AS review_date
FROM emp;

### Months Between Dates
Calculates the number of months each employee has worked.

In [ ]:
SELECT ename, TIMESTAMPDIFF(MONTH, hiredate, CURDATE()) AS months_worked
FROM emp;

### Retrieve Salary Column
Fetches the salary of all employees.

In [ ]:
SELECT sal FROM emp;

### Maximum Salary
Retrieves the highest salary paid to an employee.

In [ ]:
SELECT MAX(sal) FROM emp;

### Minimum Salary
Retrieves the lowest salary paid to an employee.

In [ ]:
SELECT MIN(sal) FROM emp;

### Total Salary
Calculates the total salary paid to all employees.

In [ ]:
SELECT SUM(sal) FROM emp;

### Average Salary
Calculates the average salary of employees.

In [ ]:
SELECT AVG(sal) FROM emp;

### Total Employee Count
Counts the total number of records in the EMP table.

In [ ]:
SELECT COUNT(*) FROM emp;

### Count of Non-NULL Names
Counts how many employees have a non-NULL name.

In [ ]:
SELECT COUNT(ename) FROM emp;

### Count of Distinct Departments
Counts the number of unique departments.

In [ ]:
SELECT COUNT(DISTINCT deptno) FROM emp;

### Employee Count by Department
Groups employees by department and counts them.

In [ ]:
SELECT deptno, COUNT(*) AS emp_count
FROM emp
GROUP BY deptno;

### Salary Range by Department
Retrieves minimum and maximum salary per department.

In [ ]:
SELECT deptno, MIN(sal) AS min_sal, MAX(sal) AS max_sal
FROM emp
GROUP BY deptno;

### Department and Job Wise Salary
Calculates total salary for each job within each department.

In [ ]:
SELECT deptno, job, SUM(sal) AS total_salary
FROM emp
GROUP BY deptno, job;

### Total Salary by Department
Calculates the total salary paid in each department.

In [ ]:
SELECT deptno, SUM(sal) AS total_salary
FROM emp
GROUP BY deptno;

### HAVING Clause Usage
Fetches departments having more than 3 employees.

In [ ]:
SELECT deptno, COUNT(*) AS emp_count
FROM emp
GROUP BY deptno
HAVING COUNT(*) > 3;

### HAVING with ORDER BY
Fetches departments with more than 3 employees and sorts them by employee count.

In [ ]:
SELECT deptno, COUNT(*) AS emp_count
FROM emp
GROUP BY deptno
HAVING COUNT(*) > 3
ORDER BY emp_count ASC;


## Summary

This notebook demonstrated how SELECT queries are used to:
- Filter rows using WHERE, IN, LIKE, and OR
- Perform string and date-based filtering
- Apply aggregate functions
- Group and summarize data using GROUP BY and HAVING
- Sort aggregated results

These patterns form the foundation of analytical querying in MySQL.